#include <stdio.h>
#include <stdlib.h>
#include <string.h>

int main(){
    int interaction;
    char password[31];
    printf("이 게임에 나오는 이름들과 주인공들은 메이블 폭군웹툰&스토리에 나와있는 이름들입니다.\n");
    printf("20XX년 XX월 XX일 에르마노 제국의 황제 메이블 윈터 가데니아 에르마노에게 전달된 이야기\n");
    printf("구스타프: 메이블 황제님!\n");
    printf("메이블: 뭔일이야? 구스타프?\n");
    printf("구스타프: 데..데블린제국이 우리나라로 마법폭탄을 발사해 곧 우리나라로와 폭파할 예정입니다!\n");
    printf("메이블: 에엑! 그럼 경로 보여줘!\n");
    printf("구스타프: 네넵!\n");
    printf("■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■\n");
    printf("■■■■데블린-------------■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■\n");
    printf("■■■■데블린■■■■■■■■■■■■|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■\n");
    printf("■■■■데블린■■■■■■■■■■■■||---------------------------■■에르마노■■■\n");
    printf("■■■■■■■■■■■■■■■■■■■■■■||■아벨라르도■■■■■■■■■■■■■■■|■■에르마노■■■\n");
    printf("■■■■■■■■■■■■■■■■■■■■■■|-■아벨라르도■■■■■■■■■■■■■■■|■■에르마노■■■\n");
    printf("■■■■■■■■■■■■■■■■■■■■■■■■■아벨라르도■■■■■■■■■■■■■■■|--에르마노■■■\n");
    printf("■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■에르마노■■■\n");
    printf("■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■\n");
    printf("■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■\n");
    printf("■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■\n");
    printf("메이블:...어! 아벨라르도근처네? 그럼 아벨라르도랑 에르마노랑 연합해서 마법폭탄을 해킹해서 데블린으로 돌려보내는건?\n");
    printf("구스타프: 네 가능은합니다만... 아벨라르도랑 연락해야하고 상황폐하한테도 보고를...\n");
    printf("메이블: 우리아빠? 그러면 우리아빠는 네가 말할테니까 구스타프는 아벨라르도에 연락해줘!\n");
    printf("구스타프: 네! 아벨라르도에 제가 마법통신으로 연락할테니 황제께서는 상황폐하께 연락을 해주십시오(다행이다 상황폐하가 얼마나 무서운데.....)\n");
    printf("메이블: 아빠~~~!\n");
    printf("에스테반: 어! 메이블~~~! 뭔일이야\n");
    printf("메이블: 데블론이 우리한테 마법폭탄을 발사해서 그거 해킹하려고! 그거 해도돼?\n");
    printf("에스테반: ????????????진짜로?\n");
    printf("메이블: 여기! 경로야\n");
    printf("■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■\n");
    printf("■■■■데블린-------------■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■\n");
    printf("■■■■데블린■■■■■■■■■■■■|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■\n");
    printf("■■■■데블린■■■■■■■■■■■■||---------------------------■■에르마노■■■\n");
    printf("■■■■■■■■■■■■■■■■■■■■■■||■아벨라르도■■■■■■■■■■■■■■■|■■에르마노■■■\n");
    printf("■■■■■■■■■■■■■■■■■■■■■■|-■아벨라르도■■■■■■■■■■■■■■■|■■에르마노■■■\n");
    printf("■■■■■■■■■■■■■■■■■■■■■■■■■아벨라르도■■■■■■■■■■■■■■■|--에르마노■■■\n");
    printf("■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■에르마노■■■\n");
    printf("■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■\n");
    printf("■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■\n");
    printf("■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■\n");
    printf("에스테반:... 국무회의 소집! (소집후)오늘부로 에르마노 제국은 데블린제국과 전쟁을 선포한다...\n");
    printf("구스타프:황제님! 아벨라르도에서 지원을 해주기로 하였습니다! 일단 우리나라에 없는 디지털프로그램과 정보를 제공해달라고 요청했습니다!\n");
    printf("메이블:오호! 그럼 프로그램이랑 정보는 어디있나요?\n구스타프:에르마노 외교용메일로 전달했다합니다\n");
    printf("메이블:그럼 내 노트북을 열어야지~~ 비번은~~ 내이름이랑내생일~\n");
    printf("■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■\n");
    printf("■■■■■■■■■■■■■■■■■■■■■■■ ERNAMOLAPTOPS ■■■■■■■■■■■■■■■■■■■■■■■■■■\n");
    printf("■■■■■■■■■■■■■■■■■■■■■■■■■■ 메이블 ■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■\n");
    printf("■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■\n");
    printf("■■■■■■■■■■■■■■■■■■■■■■■■  password: ■■■■■■■■■■■■■■■■■■■■■■■■■■■■\n");
    printf("■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■\n");
    printf("■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■\n");
    printf("■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■\n");
    printf("■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■\n");
    printf("■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■\n");
    printf("비밀번호를 입력하세요.");
    gets(password);
    if(strcmp(password, "메이블0202") == 0)
    {
        printf("맞음");
    }else
        printf("틀림");
}


}

